---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPNetworkIterator.CurrentElementId
source: html/995fbf58-5361-67e4-34d7-c4e47b5b56df.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkIterator.CurrentElementId Property

The element id at the current iteration step.

## Syntax (C#)
```csharp
public ElementId CurrentElementId { get; }
```